// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.


int a = new Random ().Next (100,1000);
Console.WriteLine (a);

